src/main/resources/xml/accommodationSalesComponentServicePort/processContainerModifyBusinessEvent/processContainerModifyBusinessEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:processContainerModifyBusinessEvent>
         <!--Optional:-->
         <request>
            <travelPlanSegmentId>?</travelPlanSegmentId>
            <byPassFreeze>?</byPassFreeze>
            <externalReferenceDetail>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </externalReferenceDetail>
            <attemptAutoReinstate>?</attemptAutoReinstate>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ejb:processContainerModifyBusinessEvent>
   </soapenv:Body>
</soapenv:Envelope>
